# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [2]:
# import required libraries
import numpy as np
import pandas as pd

Next, import `Orders` from the file `Oders.csv` located in the `data` folder into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [3]:
orders = pd.read_csv(r"C:\Users\trito.DESKTOP-V9IEUOR\Desktop\IronHack Data Analyst\Labs\week2labs\lab-df-calculation-and-transformation\data\Orders.csv", index_col = 0)
orders

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...
541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [6]:
# Sub Problem 1: How to aggregate the amount_spent for unique customers?
# orders.groupby("CustomerID").sum("amount_spent")
spent_customer = orders.groupby("CustomerID")[["amount_spent"]].sum()
spent_customer

            amount_spent
CustomerID
12346           77183.60
12347            4310.00
12348            1797.24
12349            1757.55
12350             334.40
...                  ...
18280             180.60
18281              80.82
18282             178.05
18283            2094.88
18287            1837.28

[4339 rows x 1 columns]

In [7]:
# Sub Problem 2: How to select customers whose aggregated amount_spent is in a given quantile range? 
pd.qcut(spent_customer["amount_spent"], q = [0, 0.75, 0.95, 1], labels = ["Casual", "Preferred", "VIP"])

CustomerID
12346          VIP
12347    Preferred
12348    Preferred
12349    Preferred
12350       Casual
           ...
18280       Casual
18281       Casual
18282       Casual
18283    Preferred
18287    Preferred
Name: amount_spent, Length: 4339, dtype: category
Categories (3, object): ['Casual' < 'Preferred' < 'VIP']

In [8]:
spent_customer["Customer Type"] = pd.qcut(spent_customer["amount_spent"], q = [0, 0.75, 0.95, 1], labels = ["Casual", "Preferred", "VIP"])
spent_customer

            amount_spent Customer Type
CustomerID
12346           77183.60           VIP
12347            4310.00     Preferred
12348            1797.24     Preferred
12349            1757.55     Preferred
12350             334.40        Casual
...                  ...           ...
18280             180.60        Casual
18281              80.82        Casual
18282             178.05        Casual
18283            2094.88     Preferred
18287            1837.28     Preferred

[4339 rows x 2 columns]

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [15]:
orders

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...
541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

In [13]:
orders.groupby(['CustomerID','Country'])[["amount_spent"]].sum()

                           amount_spent
CustomerID Country
12346      United Kingdom      77183.60
12347      Iceland              4310.00
12348      Finland              1797.24
12349      Italy                1757.55
12350      Norway                334.40
...                                 ...
18280      United Kingdom        180.60
18281      United Kingdom         80.82
18282      United Kingdom        178.05
18283      United Kingdom       2094.88
18287      United Kingdom       1837.28

[4347 rows x 1 columns]

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [14]:
combined = orders.groupby(['CustomerID','Country'])[["amount_spent"]].sum()

In [16]:
combined["Customer Type"] = pd.qcut(combined["amount_spent"], q = [0, 0.75, 0.95, 1], labels = ["Casual", "Preferred", "VIP"])

In [22]:
combined = combined.reset_index()
combined

      index  CustomerID         Country  amount_spent Customer Type
0         0       12346  United Kingdom      77183.60           VIP
1         1       12347         Iceland       4310.00     Preferred
2         2       12348         Finland       1797.24     Preferred
3         3       12349           Italy       1757.55     Preferred
4         4       12350          Norway        334.40        Casual
...     ...         ...             ...           ...           ...
4342   4342       18280  United Kingdom        180.60        Casual
4343   4343       18281  United Kingdom         80.82        Casual
4344   4344       18282  United Kingdom        178.05        Casual
4345   4345       18283  United Kingdom       2094.88     Preferred
4346   4346       18287  United Kingdom       1837.28     Preferred

[4347 rows x 5 columns]

In [24]:
combined.loc[(combined["Customer Type"] == "VIP") | (combined["Customer Type"] == "Preferred")]["Country"].value_counts()

United Kingdom     934
Germany             39
France              29
Belgium             11
Switzerland          9
Spain                7
Norway               7
Portugal             7
Italy                5
Finland              5
Japan                4
Australia            4
Channel Islands      4
EIRE                 3
Denmark              3
Cyprus               3
Israel               2
Sweden               2
Iceland              1
Canada               1
Malta                1
Poland               1
Greece               1
Singapore            1
Lebanon              1
Austria              1
Netherlands          1
Name: Country, dtype: int64